Revit 2026 API

# RailingReset Method

---

Resets the railing to the default one that the system generates.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Reset()
```
```vb
Public Sub Reset
```
```cpp
public:
void Reset()
```
```fsharp
member Reset : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Cannot reset the railing. |

#### Reference

Railing Class

Autodesk.Revit.DB.Architecture Namespace